cmsis-svd/cmsis-svd/data/STMicro/STM32WL5x_M0P.svd
        <register>
          <name>C2AHB3ENR</name>
          <displayName>C2AHB3ENR</displayName>
          <description>CPU2 AHB3 peripheral clock enable register           [dual core device only]</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02080000</resetValue>
          <fields>
            <field>
              <name>FLASHEN</name>
              <description>CPU2 Flash interface clock               enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPCCEN</name>
              <description>CPU2 IPCC interface clock               enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEMEN</name>
              <description>CPU2 HSEM clock enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNGEN</name>
              <description>CPU2 True RNG clocks               enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AESEN</name>
              <description>CPU2 AES accelerator clock               enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKAEN</name>
              <description>CPU2 PKA accelerator clock               enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB1ENR1</name>
          <displayName>C2APB1ENR1</displayName>
          <description>CPU2 APB1 peripheral clock enable register 1           [dual core device only]</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPTIM1EN</name>
              <description>CPU2 Low power timer 1 clocks               enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1EN</name>
              <description>CPU2 DAC1 clock enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3EN</name>
              <description>CPU2 I2C3 clocks enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2EN</name>
              <description>CPU2 I2C2 clocks enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1EN</name>
              <description>CPU2 I2C1 clocks enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2EN</name>
              <description>CPU2 USART2 clock enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2S2EN</name>
              <description>CPU2 SPI2S2 clock enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBEN</name>
              <description>CPU2 RTC APB clock enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM2EN</name>
              <description>CPU2 TIM2 timer clock               enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB1ENR2</name>
          <displayName>C2APB1ENR2</displayName>
          <description>CPU2 APB1 peripheral clock enable register 2           [dual core device only]</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>LPTIM3EN</name>
              <description>CPU2 Low power timer 3 clocks               enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM2EN</name>
              <description>CPU2 Low power timer 2 clocks               enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1EN</name>
              <description>CPU2 Low power UART 1 clocks               enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB2ENR</name>
          <displayName>C2APB2ENR</displayName>
          <description>CPU2 APB2 peripheral clock enable register           [dual core device only]</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIM17EN</name>
              <description>CPU2 TIM17 timer clock               enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16EN</name>
              <description>CPU2 TIM16 timer clock               enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1EN</name>
              <description>CPU2 USART1clocks enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>CPU2 SPI1 clock enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM1EN</name>
              <description>CPU2 TIM1 timer clock               enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADC clocks enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB3ENR</name>
          <displayName>C2APB3ENR</displayName>
          <description>CPU2 APB3 peripheral clock enable register           [dual core device only]</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>SUBGHZSPIEN</name>
              <description>CPU2 sub-GHz radio SPI clock enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2AHB1SMENR</name>
          <displayName>C2AHB1SMENR</displayName>
          <description>CPU2 AHB1 peripheral clocks enable in Sleep           modes register [dual core device only]</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00001007</resetValue>
          <fields>
            <field>
              <name>CRCSMEN</name>
              <description>CRC clock enable during CPU2 CSleep               mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUX1SMEN</name>
              <description>DMAMUX1 clock enable during CPU2 CSleep               mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2SMEN</name>
              <description>DMA2 clock enable during CPU2 CSleep               mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1SMEN</name>
              <description>DMA1 clock enable during CPU2 CSleep               mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2AHB2SMENR</name>
          <displayName>C2AHB2SMENR</displayName>
          <description>CPU2 AHB2 peripheral clocks enable in Sleep           modes register [dual core device only]</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000087</resetValue>
          <fields>
            <field>
              <name>GPIOHSMEN</name>
              <description>IO port H clock enable during CPU2               CSleep mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCSMEN</name>
              <description>IO port C clock enable during CPU2               CSleep mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBSMEN</name>
              <description>IO port B clock enable during CPU2               CSleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOASMEN</name>
              <description>IO port A clock enable during CPU2               CSleep mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2AHB3SMENR</name>
          <displayName>C2AHB3SMENR</displayName>
          <description>CPU2 AHB3 peripheral clocks enable in Sleep           mode register [dual core device only]</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x03870000</resetValue>
          <fields>
            <field>
              <name>FLASHSMEN</name>
              <description>Flash interface clock enable during CPU2               CSleep mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2SMEN</name>
              <description>SRAM2 memory interface clock enable               during CPU2 CSleep mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1SMEN</name>
              <description>SRAM1 interface clock enable during CPU2               CSleep mode.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNGSMEN</name>
              <description>True RNG clock enable during CPU2 CSleep               and CStop mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AESSMEN</name>
              <description>AES accelerator clock enable during CPU2               CSleep mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKASMEN</name>
              <description>PKA accelerator clock enable during CPU2               CSleep mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB1SMENR1</name>
          <displayName>C2APB1SMENR1</displayName>
          <description>CPU2 APB1 peripheral clocks enable in Sleep           mode register 1 [dual core device only]</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xA0E24401</resetValue>
          <fields>
            <field>
              <name>LPTIM1SMEN</name>
              <description>Low power timer 1 clock enable during               CPU2 CSleep and CStop mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1SMEN</name>
              <description>DAC1 clock enable during CPU2 CSleep               mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3SMEN</name>
              <description>I2C3 clock enable during CPU2 CSleep and               CStop modes</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2SMEN</name>
              <description>I2C2 clock enable during CPU2 CSleep and               CStop modes</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1SMEN</name>
              <description>I2C1 clock enable during CPU2 CSleep and               CStop modes</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2SMEN</name>
              <description>USART2 clock enable during CPU2 CSleep               mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2S2SMEN</name>
              <description>SPI2S2 clock enable during CPU2 CSleep               mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBSMEN</name>
              <description>RTC bus clock enable during CPU2 CSleep               mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM2SMEN</name>
              <description>TIM2 timer clock enable during CPU2               CSleep mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB1SMENR2</name>
          <displayName>C2APB1SMENR2</displayName>
          <description>CPU2 APB1 peripheral clocks enable in Sleep           mode register 2 [dual core device only]</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000061</resetValue>
          <fields>
            <field>
              <name>LPTIM3SMEN</name>
              <description>Low power timer 3 clocks enable during               CPU2 CSleep and CStop modes.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM2SMEN</name>
              <description>Low power timer 2 clocks enable during               CPU2 CSleep and CStop modes.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1SMEN</name>
              <description>Low power UART 1 clock enable during               CPU2 CSleep and CStop mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB2SMENR</name>
          <displayName>C2APB2SMENR</displayName>
          <description>CPU2 APB2 peripheral clocks enable in Sleep           mode register [dual core device only]</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00065A00</resetValue>
          <fields>
            <field>
              <name>TIM17SMEN</name>
              <description>TIM17 timer clock enable during CPU2               CSleep mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16SMEN</name>
              <description>TIM16 timer clock enable during CPU2               CSleep mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1SMEN</name>
              <description>USART1clock enable during CPU2 CSleep               and CStop mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1SMEN</name>
              <description>SPI1 clock enable during CPU2 CSleep               mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM1SMEN</name>
              <description>TIM1 timer clock enable during CPU2               CSleep mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCSMEN</name>
              <description>ADC clocks enable during CPU2 Csleep and               CStop modes</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB3SMENR</name>
          <displayName>C2APB3SMENR</displayName>
          <description>CPU2 APB3 peripheral clock enable in Sleep           mode register [dual core device only]</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000001</resetValue>
          <fields>
            <field>
              <name>SUBGHZSPISMEN</name>
              <description>sub-GHz radio SPI clock enable during CPU2 CSleep and CStop modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
